ChangerR/espcam/sdkconfig.defaults
# ESP32P4 Configuration for WiFi Remote (with ESP32C6 coprocessor)
CONFIG_IDF_TARGET="esp32p4"

# ESP WiFi Controller Target Configuration
CONFIG_ESP_WIFI_CONTROLLER_TARGET="esp32c6"

# WiFi Provisioning Settings
CONFIG_WIFI_PROV_SCAN_MAX_ENTRIES=16
CONFIG_WIFI_PROV_AUTOSTOP_TIMEOUT=30
CONFIG_WIFI_PROV_STA_ALL_CHANNEL_SCAN=y

# Device Configuration
CONFIG_ESPCAM_DEVICE_SERIAL="ESP32P4CAM001"
CONFIG_ESPCAM_MQTT_BROKER_URL="mqtt://iotdevices.site"
CONFIG_ESPCAM_HEARTBEAT_INTERVAL=30

# Partition Configuration
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"